[
  {
    "date": "2024/2/6",
    "speakers": []
  },
  {
    "date": "2024/2/7",
    "speakers": [
      {
        "id": "paulolopes",
        "name": "Paulo Lopes",
        "role": "Senior Solution Architect",
        "company": "Retail Consult",
        "talk": "Tech behind Trends: Da Ideia à Prateleira. 11h30m",
        "linkedin": "paulo-lopes-75186144",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "Paulo é Senior Solution Architect na Retail Consult, com mais de 12 anos de experiência a trabalhar com retalhistas por todo o mundo, a fornecer soluções integradas de ponta a ponta como parte de programas de transformação digital. Ao longo da sua extensa carreira, desempenhou vários papéis em diferentes domínios de negócios, como merchandising, supply chain, planeamento e otimização, desde consultoria técnica até liderança em design e implementação de arquiteturas complexas. Paulo é atualmente responsável pelo desenvolvimento de aplicações orientadas à Cloud na Retail Consult."
      },
      {
        "id": "filipesantiago",
        "name": "Filipe Santiago",
        "role": "Software Engineer",
        "company": "Aston Martin F1 Team",
        "talk": "Como o software ajuda numa equipa de Fórmula 1? 14h",
        "linkedin": "filipe-santiago-080034a4",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "Apaixonado por tecnologia e pelo desporto motorizado, o Filipe encontrou a fórmula 1 como a união perfeita dos dois mundos."
      }
    ]
  },
  {
    "date": "2024/2/8",
    "speakers": [
      {
        "id": "adelinocorreia",
        "name": "Adelino Correia",
        "role": "Manager Information and Communication Systems",
        "company": "INL",
        "talk": " A Firewall morreu! 14h",
        "linkedin": "adelino-c-50a113101",
        "github": "",
        "twitter": "",
        "href": "https://inl.int/community/adelino-correia/",
        "description": "Com background académico e profissional em TI, Adelino desempenha o cargo de IT Manager no INL, onde tem como principal objetivo potenciar a excelência da investigação do Laboratório."
      },
      {
        "id": "alekseykladov",
        "name": "Aleksey Kladov",
        "role": "Software Engineer",
        "company": "TigerBeetle & Top Rust Contributor",
        "talk": " Modern Systems Programming: Rust and Zig. 15h",
        "linkedin": "",
        "github": "matklad",
        "twitter": "",
        "href": "https://matklad.github.io/",
        "description": "Hi I'm Alexsey Kladov, I used to do math. Although I no longer do mathematics daily, it is the basis I use to think about programming. I like writing code just for the sake of it. I like deleting code even more. I like short, simple, robust and beautiful code, which not only gets the job done, but does it in an obviously correct way."
      }
    ]
  },
  {
    "date": "2024/2/9",
    "speakers": [
      {
        "id": "vitorribeiro",
        "name": "Vítor Ribeiro",
        "role": "Software Developer",
        "company": "Cegid",
        "talk": "Workshop | Cegid: AI for Business. 9h",
        "linkedin": "vitor-ribeiro-b63245b6",
        "github": "",
        "twitter": "",
        "href": "",
        "description": ""
      },
      {
        "id": "joaofolha",
        "name": "João Folha",
        "role": "Data Scientist",
        "company": "Uphold",
        "talk": "Workshop | How to build a blockchain in Python. 9h",
        "linkedin": "joão-folha",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "A data driven professional, I thrive when I achieve goals by using my logic, quantitative and problem-solving skills. My experience includes working as a Research Analyst, diving into market data to identify industry trends or to conduct competitive and product expansion strategies. Having also worked in a blockchain/cryptocurrency company, with relevant certifications, I’ve helped companies to improve efficiencies and use data to make smart decisions."
      }
    ]
  }
]
