[
  {
    "date": "2024/2/6",
    "speakers": []
  },
  {
    "date": "2024/2/7",
    "speakers": [
      {
        "id": "josecarlosalves",
        "name": "José Carlos Alves",
        "role": "IT Infrastructure Area Manager",
        "company": "MC Sonae",
        "talk": "Workshop | Platform Engineering Roadmap 9h",
        "linkedin": "josé-carlos-alves-5424a94",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "O José Carlos é licenciado em Engenharia de Sistemas e Informática pela Universidade do Minho. Com mais de 20 anos de experiência na área de gestão TI, atualmente tem a liderança das áreas que fazem o desenho, implementação, gestão e operação de todos os serviços de infraestrutura de TI (on-premises e/ou  cloud) e que são a base e o suporte de todos os serviços e soluções de tecnologia que suportam os sistemas de informação da MC Sonae. Contribui de forma ativa para transformar soluções tecnológicas de infraestrutura em vantagem competitiva para a organização, desafiando e potenciando o trabalho em equipa."
      },
      {
        "id": "tiagoferreira",
        "name": "Tiago Ferreira",
        "role": "Architecture & Infrastructure Tech Lead",
        "company": "MC Sonae",
        "talk": "Workshop | Platform Engineering Roadmap 9h",
        "linkedin": "tiago-ferreira-399340a",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "O Tiago Ferreira é licenciado em Engenharia de Sistemas e Informática pela Universidade do Minho. Depois de ter passado pelo desenvolvimento de software, há mais de 10 anos, tem feito um percurso mais ligado às áreas de infraestruturas de TI apoiando de perto as equipas de desenvolvimento, sendo visto como uma referência. Atualmente exerce a função de Tech Lead na área de Architecture&Infrastructure na direção de Business Information Technology (BIT) da MC Sonae."
      },
      {
        "id": "ricardomartins",
        "name": "Ricardo Martins",
        "role": "Security Strategy and Architecture Area Manager",
        "company": "MC Sonae",
        "talk": "Workshop | Security Analysis and Vulnerability Management 9h",
        "linkedin": "ricardo3tm",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "O Ricardo Martins é Licenciado e Mestre em Engenharia de Electrónica e de Telecomunicações, frequentando atualmente o Programa Doutoral em Engenharia Informática pela Universidade de Aveiro. Com 26 anos de experiência na área de suporte e gestão TIC, o Ricardo especializou-se em Cibersegurança nos últimos 6 anos, sendo atualmente responsável pela área de Estratégia e Arquitetura de Segurança na direção de Business Information Technology (BIT) da MC Sonae."
      },
      {
        "id": "alfredofranca",
        "name": "Alfredo França",
        "role": "Operation Security Coordinator",
        "company": "MC Sonae",
        "talk": "Workshop | Security Analysis and Vulnerability Management 9h",
        "linkedin": "alfredofranca",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "Com uma sólida experiência no campo da Cibersegurança, o Alfredo atualmente exerce a função de Tech Lead na área de Segurança na direção de Business Information Technology (BIT) da MC Sonae, sendo responsável pela área de “Segurança Ofensiva”.\nPara além disso, tem um forte compromisso com a partilha de conhecimento, lecionando na Licenciatura de Segurança de Redes e Computadores na ESTGF (Politécnico do Porto), onde partilha a sua experiência em disciplinas como “Auditoria Informática” e “Testes de Penetração e Hacking Ético”."
      },
      {
        "id": "tiagopinto",
        "name": "Tiago Pinto",
        "role": "COO & Co-Founder",
        "company": "CodeSec",
        "talk": "Workshop | How to protect your web applications. A practical guide from exploring to mitigating it. 9h",
        "linkedin": "tiagoavpinto",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "I am a certified Application Security Architect with a demonstrated history of working in the managed security industry and with a background in software development.\nDuring the last 5 years, while working in managed security services companies, I’ve worn the security architect and manager hats. I provided consultancy and managed the implementation of security programs in various organizations, including large enterprise companies, in different verticals. \nMy goal in my current role at CodSec is to help software development organizations to transform their AppSec program with Practical Secure Software Development Life Cycle (SDLC) as a Service. I’m focused on partnering with developers to help them design and implement security into SDLC. I love sharing my practical experience in threat modeling, security testing, code reviews, vulnerability management, and cloud-based security.\nMy passion is to leverage technologies for process automation - to automate the monitoring, alerting, and mitigation/prevention of risks associated with the Software Development Life Cycle."
      },
      {
        "id": "paulolopes",
        "name": "Paulo Lopes",
        "role": "Senior Solution Architect",
        "company": "Retail Consult",
        "talk": "Tech behind Trends: Da Ideia à Prateleira. 11h30m",
        "linkedin": "paulo-lopes-75186144",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "Paulo é Senior Solution Architect na Retail Consult, com mais de 12 anos de experiência a trabalhar com retalhistas por todo o mundo, a fornecer soluções integradas de ponta a ponta como parte de programas de transformação digital. Ao longo da sua extensa carreira, desempenhou vários papéis em diferentes domínios de negócios, como merchandising, supply chain, planeamento e otimização, desde consultoria técnica até liderança em design e implementação de arquiteturas complexas. Paulo é atualmente responsável pelo desenvolvimento de aplicações orientadas à Cloud na Retail Consult."
      },
      {
        "id": "filipesantiago",
        "name": "Filipe Santiago",
        "role": "Software Engineer",
        "company": "Aston Martin F1 Team",
        "talk": "Como o software ajuda numa equipa de Fórmula 1? 14h",
        "linkedin": "filipe-santiago-080034a4",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "Apaixonado por tecnologia e pelo desporto motorizado, o Filipe encontrou a fórmula 1 como a união perfeita dos dois mundos."
      }
    ]
  },
  {
    "date": "2024/2/8",
    "speakers": [
      {
        "id": "adelinocorreia",
        "name": "Adelino Correia",
        "role": "Manager Information and Communication Systems",
        "company": "INL",
        "talk": " A Firewall morreu! 14h",
        "linkedin": "adelino-c-50a113101",
        "github": "",
        "twitter": "",
        "href": "https://inl.int/community/adelino-correia/",
        "description": "Com background académico e profissional em TI, Adelino desempenha o cargo de IT Manager no INL, onde tem como principal objetivo potenciar a excelência da investigação do Laboratório."
      },
      {
        "id": "alekseykladov",
        "name": "Aleksey Kladov",
        "role": "Software Engineer",
        "company": "TigerBeetle & Top Rust Contributor",
        "talk": " Modern Systems Programming: Rust and Zig. 15h",
        "linkedin": "",
        "github": "matklad",
        "twitter": "",
        "href": "https://matklad.github.io/",
        "description": "Hi I'm Alexsey Kladov, I used to do math. Although I no longer do mathematics daily, it is the basis I use to think about programming. I like writing code just for the sake of it. I like deleting code even more. I like short, simple, robust and beautiful code, which not only gets the job done, but does it in an obviously correct way."
      }
    ]
  },
  {
    "date": "2024/2/9",
    "speakers": [
      {
        "id": "vitorribeiro",
        "name": "Vítor Ribeiro",
        "role": "Software Developer",
        "company": "Cegid",
        "talk": "Workshop | Cegid: AI for Business. 9h",
        "linkedin": "vitor-ribeiro-b63245b6",
        "github": "",
        "twitter": "",
        "href": "",
        "description": ""
      },
      {
        "id": "joaofolha",
        "name": "João Folha",
        "role": "Data Scientist",
        "company": "Uphold",
        "talk": "Workshop | How to build a blockchain in Python. 9h",
        "linkedin": "joão-folha",
        "github": "",
        "twitter": "",
        "href": "",
        "description": "A data driven professional, I thrive when I achieve goals by using my logic, quantitative and problem-solving skills. My experience includes working as a Research Analyst, diving into market data to identify industry trends or to conduct competitive and product expansion strategies. Having also worked in a blockchain/cryptocurrency company, with relevant certifications, I’ve helped companies to improve efficiencies and use data to make smart decisions."
      }
    ]
  }
]
