{
  "0": [
    {
      "speakerID": "joaooliveira",
      "initStatus": "hide",
      "label": "Talk. 15h",
      "name": "João Oliveira",
      "job": "Chief Technical Officer",
      "description": "TonicApp SA",
      "picture": "../images/speakers/joaooliveira.jpg",
      "bio": [
        "Aos 14 anos de idade João vendeu o seu primeiro software por 30 “contos”, aos 17 foi finalista das Olimpíadas de Informática, aos 26 co-fundou a empresa que lançou o primeiro ERP português disponível como Software as a Service, software distinguido, 2 anos depois, com o prémio “Inovação Tecnológica em PME” promovido pela Oracle e Intel.",
        "João Oliveira é licenciado pela Universidade do Minho, tem um trajeto profissional diversificado, no setor público e privado, co-fundou uma startup onde foi Chief Technical Officer e Arquitecto de Software, e nos últimos anos passou por multinacionais da área das telecomunicações (Wedo Technologies) e da indústria de moda de luxo (Farfetch). Desde o início de 2020 é Chief Technical Officer na TonicApp SA, empresa que desenvolve uma plataforma digital de saúde desenvolvida para apoiar a comunidade médica a diagnosticar e a tratar os doentes, empresa que está presente em Portugal, Espanha, França e Itália."
      ],
      "day": 0,
      "linkedin": "http://linkedin.com/in/joaooliveira"
    }
  ],
  "1": [
    {
      "speakerID": "tiagocarcao",
      "initStatus": "hide",
      "label": "Talk. 15h",
      "name": "Tiago Carção",
      "job": "Software Engineer and Tech Lead",
      "description": "Glovo",
      "picture": "../images/speakers/tiagocarcao.png",
      "bio": [
        "Sou o Tiago Carção e fiz a graduação em Engenharia Informática na Universidade do Minho. Desde sempre, o impacto que a tecnologia consegue trazer às nossas vidas todos os dias e em tudo o que fazemos, é algo que me fascina!",
        "Fui cofundador de duas startups (uma ainda em execução e em total força yay!), trabalhei na Farfetch (e-commerce), Revolut (fintech) e, atualmente, trabalho na Glovo (on-demand courier service). Por isso, compreendo os problemas inerentes de uma startup que está a crescer e, por outro lado, as questões que uma grande empresa enfrenta.",
        "Pessoalmente, gosto de trabalhar em sistemas distribuídos com grande escala. Problemas reais e que precisam de decisões rápidas e não comprometedoras. É difícil manter-me motivado, pois preciso de me sentir desafiado todos os dias! Amo trabalhar num ambiente de equipa altamente motivado a aprender e a evoluir alinhado a um bom desafio tecnológico.",
        "Acredito que só em equipa aprendendo uns com os outros podemos, realmente, crescer pessoalmente e profissionalmente. Sobretudo na área da tecnologia a partilha de conhecimento em equipa faz sentido: aprender e partilhar, tomar decisões bem ponderadas e baseadas em bons princípios! Além da tecnologia (que ocupa grande parte da minha vida :p) gosto de acompanhar muitos desportos, mais especificamente futebol (global), NBA, NFL, cinema e de ler."
      ],
      "day": 1,
      "linkedin": "https://www.linkedin.com/in/tiagocarcao/"
    },
    {
      "speakerID": "julianacarvalho",
      "initStatus": "hide",
      "label": "Talk. 17h30",
      "name": "Juliana Carvalho",
      "job": "Trainer and Project Manager",
      "description": "Unlimited Future",
      "picture": "../images/speakers/julianacarvalho.png",
      "bio": [
        "Fiz todo o percurso académico na Faculdade de Letras da Universidade do Porto, onde me especializei em Sociologia. Desde os tempos da faculdade sempre achei importante ter a minha independência e conhecer o mercado de trabalho, por isso tive o meu primeiro emprego enquanto ainda estava a estudar. Para além disso, fui completando a minha experiência com alguns projetos de voluntariado, especialmente com crianças e jovens.",
        "Em 2015, integrei a equipa do projeto Inspiring Future, para alargar as atividades para a zona norte do país, através do qual me tornei formadora e exerci funções como coordenadora da equipa norte que percorre mais de uma centena de escolas secundárias. Através da organização da feira de instituições de ensino superior, workshops e sessões sobre o acesso ao ensino superior, ajudamos os alunos do 12º ano a fazer a transição para o ensino superior ou para o mercado de trabalho. O nosso objetivo é trabalhar algumas competências que consideramos fundamentais nesta fase, ao mesmo tempo que auxiliamos os alunos a tomarem decisões mais conscientes e informadas acerca do seu futuro académico e/ou profissional. Atualmente, integro o projeto Unlimited Future, onde tenho vindo a alargar a minha atuação ao nível da formação com alunos do ensino superior e profissional, tendo em vista a preparação dos jovens para o mercado de trabalho."
      ],
      "day": 1,
      "twitter": "",
      "github": "",
      "linkedin": "https://www.linkedin.com/in/juliana-viegas-carvalho/"
    }
  ],
  "2": [
    {
      "speakerID": "goncalosilva",
      "initStatus": "hide",
      "label": "Talk. 15h",
      "name": "Gonçalo Silva",
      "job": "Chief Technical Officer",
      "description": "Doist",
      "picture": "../images/speakers/goncalosilva.jpg",
      "bio": [
        "Gonçalo is the CTO at Doist, creators of Todoist and Twist. He's been working remotely for over a decade, and managing remote teams for most of that time. He loves long-term ambition, asynchronous communication, and programming."
      ],
      "day": 2,
      "twitter": "https://twitter.com/goncalossilva",
      "github": "https://github.com/goncalossilva",
      "linkedin": "https://www.linkedin.com/in/goncalossilva/"
    },
    {
      "speakerID": "nunosantos",
      "initStatus": "hide",
      "label": "Workshop Primavera. 9h30",
      "name": "Nuno Santos",
      "job": "Software Engineer",
      "description": "Primavera",
      "picture": "../images/speakers/nunosantos.jpg",
      "bio": [
        "Formado em Engenharia Informática pela Faculdade de Engenharia da Universidade do Porto, conta já com 6 anos de experiência como Software Engineer na PRIMAVERA BSS, trabalhando no produto Jasmin, desde o seu nascimento, há 4 anos."
       ],
      "day": 2,
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    {
      "speakerID": "jorgeribeiro",
      "initStatus": "hide",
      "label": "Workshop Primavera. 9h30",
      "name": "Jorge Ribeiro",
      "job": "Team Leader",
      "description": "Primavera",
      "picture": "../images/speakers/jorgeribeiro.jpg",
      "bio": [
        "Formado em Engenharia Informática pela Universidade do Minho, conta já com 16 anos de experiência na área de desenvolvimento de software. Na PRIMAVERA BSS começou como Software Engineer, tornou-se Technical Lead de uma equipa de tecnologia, e há 2 anos lidera a equipa do Jasmin, o primeiro ERP 100% cloud da PRIMAVERA."
      ],
      "day": 2,
      "twitter": "",
      "github": "",
      "linkedin": ""
    }
  ],
  "3": [
    {
      "speakerID": "andrelago",
      "initStatus": "hide",
      "label": "Talk. 15h",
      "name": "André Lago",
      "job": "Software Engineer and Tech Lead",
      "description": "Google",
      "picture": "../images/speakers/andrelago.jpg",
      "bio": [
        "O André é Software Engineer e Tech Lead na Google, em Munique na Alemanha. A equipa do André desenvolve produtos externos de privacidade essenciais na Google, que todos os dias ajudam milhões de utilizadores a gerir a sua privacidade online.",
        "O André é apaixonado por tecnologia desde criança e adora aprender coisas novas por conta própria. Desde que começou a estudar na Universidade do Porto, ele trabalhou em projetos diversos, desde assistentes inteligentes para gerir sistemas IoT a jogos 3D. O André também participou em vários projetos não técnicos, tais como ser o CEO de uma empresa de 50 estudantes e ser o Conference Chair de uma conferência com mais de 500 participantes.",
        "Para além de tecnologia, o André gosta de música, basquetebol e surf."
      ],
      "day": 3,
      "twitter": "https://twitter.com/andrelago13",
      "github": "https://github.com/andrelago13",
      "linkedin": "http://linkedin.com/in/andre-lago/"
    },
    {
      "speakerID": "joaoandrade",
      "initStatus": "hide",
      "label": "Workshop Bosch. 9h30",
      "name": "João Andrade",
      "job": "Scrum Master",
      "description": "Bosch",
      "picture": "../images/speakers/joaoandrade.jpg",
      "bio": [],
      "day": 3,
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    {
      "speakerID": "joaoribeiro",
      "initStatus": "hide",
      "label": "Workshop Bosch. 9h30",
      "name": "João Ribeiro",
      "job": "Perception Architect",
      "description": "Bosch",
      "picture": "../images/speakers/joaoribeiro.jpg",
      "bio": [],
      "day": 3,
      "twitter": "",
      "github": "",
      "linkedin": ""
    }
    ,{
      "speakerID": "lucianosousa",
      "initStatus": "hide",
      "label": "Workshop Bosch. 9h30",
      "name": "Luciano Sousa",
      "job": "Product Owner",
      "description": "Bosch",
      "picture": "../images/speakers/lucianosousa.png",
      "bio": [],
      "day": 3,
      "twitter": "",
      "github": "",
      "linkedin": ""
    }
  ]
}
